#+TITLE: pxrac-1969
NOTE: vendortimestamputc is stored as a number in DDB currently and we format it
as a string, but that gives us the weird isoformat "T" in the middle of the
string and it's not clear that's what we should be doing.
* Tags:
** Project: [[file:20200302112454_oddsapi.org][oddsAPI]]
** Started: [[file:2020-03-02.org][2020-03-02]]
** Closed: [[file:2020-03-03.org][2020-03-03]]
** Sprint: [[file:20200303164352_sprint_45.org][sprint 45]]
* Links:
** JIRA: https://jira.phoenix.local/browse/PXRAC-1969
** local repo/file: [[file:~/Repositories/oddsapi/src/lib_odds/lib_odds_get.py][lib_odds_get.py]]
* Description:
Per Harold: too many odds payoads returned for simple GET request, unintuitive
format for response
* Sample links/payloads
** Sample problem url
#+begin_src restclient
GET https://live-scoring-sit.feeds-trading-sit.aws.phoenix/odds-api/odds/20200224AUBAT104?transactionid=test
#+end_src

** Sample successful url
#+begin_src restclient
GET https://live-scoring-dev.feeds-dev.aws.phoenix/odds-api/odds/20200221AUAPK106?transactionid=test
#+end_src


** Dynamic Dev Tests:
*** /healthcheck
#+begin_src restclient
GET https://live-scoring-dev-pxrac-1969-too-many-payloads.feeds-dev.aws.phoenix/odds-api/healthcheck
#+end_src

#+RESULTS:
#+begin_example
,#+BEGIN_SRC html
I am Alive!
<!-- GET https://live-scoring-dev-pxrac-1969-too-many-payloads.feeds-dev.aws.phoenix/odds-api/healthcheck -->
<!-- HTTP/1.1 200 OK -->
<!-- Date: Tue, 03 Mar 2020 04:07:13 GMT -->
<!-- Content-Type: text/html; charset=utf-8 -->
<!-- Content-Length: 11 -->
<!-- Connection: keep-alive -->
<!-- Server: nginx/1.15.6 -->
<!-- Request duration: 4.438070s -->
,#+END_SRC
#+end_example

*** PUT odds/
#+begin_src restclient
PUT https://live-scoring-dev-pxrac-1969-too-many-payloads.feeds-dev.aws.phoenix/odds-api/odds?transactionid=pxrac-1969
Content-type: application/json
< ~/Repositories/oddsapi/src/sample_responses/odds_put3.json
#+end_src

#+RESULTS:
#+BEGIN_SRC js
{
  "message": "OK",
  "response": "Odds Successfully Entered",
  "transactionid": "pxrac-1969"
}
// PUT https://live-scoring-dev-pxrac-1969-too-many-payloads.feeds-dev.aws.phoenix/odds-api/odds?transactionid=pxrac-1969
// HTTP/1.1 200 OK
// Date: Tue, 03 Mar 2020 04:16:21 GMT
// Content-Type: application/json
// Content-Length: 98
// Connection: keep-alive
// Server: nginx/1.15.6
// Request duration: 0.293257s
#+END_SRC

*** GET odds
#+begin_src restclient
GET https://live-scoring-dev-pxrac-1969-too-many-payloads.feeds-dev.aws.phoenix/odds-api/odds/20191205FRSAD105?transactionid=pxrac
#+end_src

